Revit 2027 API
IFCLegacyStairOrRamp.GetStringerGeometries Method
 Gets the geometries of stringers.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<GeometryObject> GetStringerGeometries()
Public Function GetStringerGeometries As IList(Of GeometryObject)
public:
IList<GeometryObject^>^ GetStringerGeometries()
member GetStringerGeometries : unit -> IList<GeometryObject>
Return Value
IList<GeometryObject>
 The geometries of stringers.
See Also
Reference
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace